tap "datawire/blackbird"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "ktr0731/evans"
# tap "rerost/tools"
tap "sanemat/font"
tap "teamookla/speedtest"
tap "uzimaru0000/tap"
tap "wantedly/tools", "git@github.com:wantedly/homebrew-tools"
tap "yoheimuta/protolint"
brew "awscli", link: false
brew "bat"
brew "btop"
brew "glib"
brew "tcl-tk"
brew "deno"
# brew "dep"
brew "diff-so-fancy"
brew "direnv"
brew "envchain"
brew "exa"
brew "fd"
brew "gobject-introspection"
brew "harfbuzz"
brew "pango"
brew "fontforge"
brew "fzf"
brew "gdk-pixbuf"
brew "little-cms2"
brew "openjpeg"
brew "gh"
brew "ghq"
brew "git"
brew "goenv"
brew "librsvg"
brew "graphviz"
brew "htop"
brew "imagemagick@6", link: false 
brew "jq"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "node-build"
brew "nodenv"
brew "openjdk"
brew "openjdk@11"
brew "protobuf"
brew "pstree"
brew "python-yq"
# brew "python@3.8", link: false
# brew "python@3.9"
# brew "python@3.10", link: false
brew "python@3.11"
brew "ruby-build"
brew "rbenv"
# brew "redis@3.2", restart_service: true
brew "ripgrep"
brew "shared-mime-info"
brew "stow"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "watch"
brew "yarn"
brew "datawire/blackbird/telepresence", link: false
brew "ktr0731/evans/evans"
brew "rerost/tools/giro"
# brew "sanemat/font/ricty", args: ["with-powerline"]
brew "teamookla/speedtest/speedtest"
brew "uzimaru0000/tap/tv"
# brew "yoheimuta/protolint/protolint"
cask "alacritty"
cask "chromedriver"
cask "docker"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "iterm2"
cask "keycastr"

+vscode "Angular.ng-template"
+vscode "arcticicestudio.nord-visual-studio-code"
+vscode "bradlc.vscode-tailwindcss"
+vscode "dbaeumer.vscode-eslint"
+vscode "eamodio.gitlens"
+vscode "esbenp.prettier-vscode"
+vscode "formulahendry.auto-rename-tag"
+vscode "GitHub.copilot"
+vscode "GraphQL.vscode-graphql"
+vscode "GraphQL.vscode-graphql-syntax"
+vscode "johnpapa.vscode-peacock"
+vscode "jpoissonnier.vscode-styled-components"
+vscode "PKief.material-icon-theme"
+vscode "Prisma.prisma"
+vscode "stylelint.vscode-stylelint"
+vscode "vscodevim.vim"
+vscode "wmaurer.change-case"
+vscode "yoavbls.pretty-ts-errors"
