# Shared Brewfile
# Common packages across all machines

# Taps
tap "datawire/blackbird"
tap "homebrew/bundle"
tap "homebrew/services"
tap "sanemat/font"
tap "uzimaru0000/tap"
tap "wantedly/tools", "git@github.com:wantedly/homebrew-tools"

# Core utilities and tools
brew "actionlint"
brew "awscli"
brew "bat"
brew "cairo"
brew "deno"
brew "diff-so-fancy"
brew "direnv"
brew "docutils"
brew "envchain"
brew "eza"
brew "fd"
brew "fontforge"
brew "fzf"
brew "gdk-pixbuf"
brew "gh"
brew "ghq"
brew "git"
brew "glib"
brew "gobject-introspection"
brew "goenv"
brew "graphviz"
brew "harfbuzz"
brew "htop"
brew "jq"
brew "librsvg"
brew "little-cms2"
brew "neofetch"
brew "neovim"
brew "node-build"
brew "nodenv"
brew "openjpeg"
brew "pango"
brew "protobuf"
brew "pstree"
brew "python-yq"
brew "python@3.8"
brew "python@3.9"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "rbenv"
brew "ripgrep"
brew "ruby-build"
brew "shared-mime-info"
brew "starship"
brew "stow"
brew "tcl-tk"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "watch"
brew "yarn"

# Tap-specific packages
brew "datawire/blackbird/telepresence", link: false
brew "uzimaru0000/tap/tv"

# Casks
cask "alacritty"
cask "chromedriver"
cask "claude-code"
cask "docker-desktop"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "keycastr"
cask "visual-studio-code"

# VSCode Extensions
vscode "anthropic.claude-code"
vscode "apollographql.vscode-apollo"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "kaiwood.endwise"
vscode "orta.vscode-twoslash-queries"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "vscodevim.vim"
vscode "wallabyjs.console-ninja"
vscode "wayou.vscode-todo-highlight"
vscode "wmaurer.change-case"
vscode "yoavbls.pretty-ts-errors"
