tap "creasty/tools"
tap "datawire/blackbird"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "izumin5210/tools"
tap "ktr0731/evans"
tap "sanemat/font"
tap "teamookla/speedtest"
cask "osxfuse"
brew "readline"
brew "deno"
brew "dep"
brew "direnv"
brew "envchain"
brew "exa"
brew "fd"
brew "fzf"
brew "git"
brew "goenv"
brew "imagemagick@6", link: true
brew "jq"
brew "node-build"
brew "nodenv"
brew "protobuf"
brew "ruby-build"
brew "rbenv"
brew "redis@3.2", restart_service: true
brew "ripgrep"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "watch"
brew "yarn"
brew "datawire/blackbird/telepresence"
brew "izumin5210/tools/grapi"
brew "ktr0731/evans/evans"
brew "sanemat/font/ricty", args: ["with-powerline"]
brew "teamookla/speedtest/speedtest"
brew "diff-so-fancy"
cask "cyberduck"
cask "graphiql"
cask "font-hackgen"
cask "insomnia"
cask "iterm2"
cask "java"
cask "virtualbox"
