apollographql.vscode-apollo
arcticicestudio.nord-visual-studio-code
astro-build.astro-vscode
bradlc.vscode-tailwindcss
chakrounanas.turbo-console-log
dbaeumer.vscode-eslint
denoland.vscode-deno
eamodio.gitlens
esbenp.prettier-vscode
figma.figma-vscode-extension
github.vscode-github-actions
graphql.vscode-graphql
graphql.vscode-graphql-syntax
jock.svg
johnpapa.vscode-peacock
kaiwood.endwise
karunamurti.haml
orta.vscode-jest
orta.vscode-twoslash-queries
pkief.material-icon-theme
prisma.prisma
shopify.ruby-lsp
streetsidesoftware.code-spell-checker
styled-components.vscode-styled-components
stylelint.vscode-stylelint
taichi.vscode-textlint
tamasfe.even-better-toml
vscodevim.vim
vsls-contrib.codetour
wallabyjs.console-ninja
wayou.vscode-todo-highlight
wmaurer.change-case
yoavbls.pretty-ts-errors
zainchen.json
zxh404.vscode-proto3
